{
    "books": [
      {
        "id": "1",
        "title": "Alice in Wonderland",
        "author": "Lewis Carroll",
        "publication_year": 1865,
        "genre": "Fantasy",
        "main_characters": ["Alice", "The Mad Hatter", "Cheshire Cat"],
        "summary": "Alice in Wonderland is a fantasy novel written by Lewis Carroll. The story follows the adventures of Alice, a young girl who falls down a rabbit hole and finds herself in a strange and wonderful world. She encounters eccentric characters such as the Mad Hatter and the Cheshire Cat, and must navigate through absurd trials to find her way. The book has become a classic of children's literature and has captivated readers of all ages since its publication."
      },
      {
        "id": "2",
        "title": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "publication_year": 1960,
        "genre": "Fiction",
        "main_characters": ["Scout Finch", "Atticus Finch", "Boo Radley"],
        "summary": "To Kill a Mockingbird is a fiction novel by Harper Lee. Set in the American South during the 1930s, it explores themes of racial injustice and moral growth. The story is narrated by Scout Finch, a young girl, as she observes her father, lawyer Atticus Finch, defend a black man wrongly accused of raping a white woman. The novel is a classic of modern American literature."
      },
      {
        "id": "3",
        "title": "1984",
        "author": "George Orwell",
        "publication_year": 1949,
        "genre": "Dystopian Fiction",
        "main_characters": ["Winston Smith", "Julia", "Big Brother"],
        "summary": "1984 is a dystopian fiction novel by George Orwell. It is set in a totalitarian society where the government, led by the omnipresent Big Brother, controls every aspect of people's lives. The story follows Winston Smith, a man who rebels against the oppressive regime and seeks truth and freedom. The novel is a chilling exploration of surveillance, censorship, and the power of the state."
      },
      {
        "id": "4",
        "title": "Pride and Prejudice",
        "author": "Jane Austen",
        "publication_year": 1813,
        "genre": "Romance",
        "main_characters": ["Elizabeth Bennet", "Mr. Darcy", "Jane Bennet"],
        "summary": "Pride and Prejudice is a romance novel by Jane Austen. The story follows the lively Elizabeth Bennet as she navigates the societal expectations of 19th-century England. The novel explores themes of love, class, and personal growth, and is celebrated for its wit and social commentary."
      },
      {
        "id": "5",
        "title": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "publication_year": 1925,
        "genre": "Classic Fiction",
        "main_characters": ["Jay Gatsby", "Daisy Buchanan", "Nick Carraway"],
        "summary": "The Great Gatsby is a classic fiction novel by F. Scott Fitzgerald. Set in the Roaring Twenties, the story is narrated by Nick Carraway, who becomes entangled in the lives of the mysterious Jay Gatsby and the beautiful but elusive Daisy Buchanan. The novel explores themes of wealth, love, and the American Dream."
      },
      {
        "id": "6",
        "title": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "publication_year": 1937,
        "genre": "Fantasy",
        "main_characters": ["Bilbo Baggins", "Gandalf", "Thorin Oakenshield"],
        "summary": "The Hobbit is a fantasy novel by J.R.R. Tolkien. It follows the journey of Bilbo Baggins, a hobbit who is reluctantly thrust into an epic quest to reclaim a treasure guarded by the fearsome dragon Smaug. Along the way, Bilbo encounters elves, dwarves, and goblins, and discovers courage and resourcefulness within himself."
      }
    ]
  }